eksempler/soap/5_response_forretningskvittering_fra_meldingsformidler_til_postavsender.xml

<S12:Envelope xmlns:S12="http://www.w3.org/2003/05/soap-envelope" xmlns:eb="http://docs.oasis-open.org/ebxml-msg/ebms/v3.0/ns/core/200704/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <S12:Header>
    <wsse:Security S12:mustUnderstand="true">
      <!-- TODO  -->
    </wsse:Security>
    <eb:Messaging S12:mustUnderstand="true">
	    <!-- TODO ser ikke behov for mpc, kan utelates ref spec-->
      <!--<eb:UserMessage mpc="http://sender.example.com/mpc123">-->
	    <eb:UserMessage>
        <eb:MessageInfo>
          <eb:Timestamp>2006-10-01T10:02:00</eb:Timestamp>
          <eb:MessageId>UUID-5@sender.example.com</eb:MessageId>
          <eb:RefToMessageId>UUID-4@receiver.example.com</eb:RefToMessageId>
        </eb:MessageInfo>
        <eb:PartyInfo>
	        <eb:From>
		        <eb:PartyId>partyId</eb:PartyId>
		        <eb:Role>role</eb:Role>
	        </eb:From>
	        <eb:To>
		        <eb:PartyId>partyId</eb:PartyId>
		        <eb:Role>role</eb:Role>
	        </eb:To>
          <!-- TODO -->
        </eb:PartyInfo>
        <eb:CollaborationInfo>
	        <eb:AgreementRef>agreement</eb:AgreementRef>
	        <eb:Service>service</eb:Service>
	        <eb:Action>action</eb:Action>
	        <eb:ConversationId>GUID-Conversation-ID</eb:ConversationId>
	      </eb:CollaborationInfo>
        <eb:PayloadInfo>
	        <eb:PartInfo href="#soapBody"/>
          <!-- TODO -->
        </eb:PayloadInfo>
      </eb:UserMessage>
    </eb:Messaging>
  </S12:Header>
  <S12:Body xml:id="soapBody">
	  <!-- TODO er dette ok -->
	  <StandardBusinessDocument xmlns="http://www.unece.org/cefact/namespaces/StandardBusinessDocumentHeader">
		  <StandardBusinessDocumentHeader>
			  <HeaderVersion>1.0</HeaderVersion>
			  <Sender>
				  <!-- orgnr avsender -->
				  <Identifier Authority="iso6523-actorid-upis">9908:123456789</Identifier>
			  </Sender>
			  <Receiver>
				  <!-- orgnr mottaker, postboks eller print -->
				  <Identifier Authority="iso6523-actorid-upis">9908:345678901</Identifier>
			  </Receiver>
			  <DocumentIdentification>
				  <!-- Unik identifikator i "Sender" sitt scope -->
				  <Standard>urn:no:kommune:leikanger:sdp:barnehage:1.0</Standard>
				  <TypeVersion>1.0</TypeVersion>
				  <InstanceIdentifier>2014/001</InstanceIdentifier>
				  <!-- Dette er den reelle unike identifikatoren i SDBH - bør vera GUID! -->
				  <Type>Sikkerpost</Type>
				  <CreationDateAndTime>2013-02-19T05:10:10Z</CreationDateAndTime>
			  </DocumentIdentification>
		  </StandardBusinessDocumentHeader>
		  <sdp:meldingskvittering xmlns:sdp="http://begrep.difi.no/sdp/schema_v10">
			  <!-- .... -->
		  </sdp:meldingskvittering>
	  </StandardBusinessDocument>
  </S12:Body>
</S12:Envelope>